["school", "of", "computing", "sciences", "uea", "vacancies", "contact", "us", "sign", "in", "uea", "students", "and", "staff", "everyone", "else", "main", "menu", "home", "study", "with", "us", "go", "to", "study", "with", "us", "home", "undergraduate", "course", "finder", "clearing", "and", "adjustment", "request", "prospectus", "mini", "open", "day", "applying", "accommodation", "scholarships", "fees", "and", "funding", "visit", "us", "student", "life", "advice", "for", "future", "students", "mature", "students", "your", "future", "career", "ask", "uea", "new", "students", "postgraduate", "course", "finder", "accommodation", "applying", "request", "prospectus", "postgraduate", "taught", "degrees", "fees", "scholarships", "and", "loans", "visit", "us", "postgraduate", "research", "degrees", "phds", "studentships", "research", "themes", "fees", "and", "funding", "how", "to", "apply", "meet", "our", "students", "international", "your", "country", "eu", "students", "studying", "in", "the", "uk", "applying", "as", "an", "international", "student", "fees", "and", "funding", "visit", "us", "accommodation", "international", "families", "international", "summer", "school", "malaysia", "international", "office", "foundation", "and", "diploma", "programmes", "international", "programmes", "contact", "us", "short", "courses", "and", "professional", "development", "foundation", "courses", "cpd", "summer", "schools", "free", "online", "learning", "information", "for", "parents", "teachers", "young", "people", "parents", "teachers", "young", "people", "study", "abroad", "and", "exchange", "incoming", "outgoing", "contact", "us", "research", "research", "research", "themes", "explore", "uea", "research", "postgraduate", "research", "about", "uea", "research", "research", "performance", "fellowships", "faculties", "and", "schools", "go", "to", "faculties", "and", "schools", "home", "arts", "and", "humanities", "art", "media", "and", "american", "studies", "history", "interdisciplinary", "institute", "for", "the", "humanities", "literature", "drama", "and", "creative", "writing", "politics", "philosophy", "language", "and", "communication", "studies", "graduate", "school", "medicine", "and", "health", "sciences", "health", "sciences", "norwich", "medical", "school", "centre", "for", "interprofessional", "practice", "continuing", "professional", "development", "graduate", "school", "science", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "computing", "sciences", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "physics", "graduate", "school", "social", "sciences", "economics", "education", "and", "lifelong", "learning", "geography", "international", "development", "law", "norwich", "business", "school", "psychology", "social", "work", "graduate", "school", "business", "go", "to", "business", "home", "contact", "us", "funding", "opportunities", "sponsored", "research", "knowledge", "transfer", "partnerships", "consultancy", "gis", "consulting", "consultancy", "case", "studies", "facilities", "testing", "conference", "space", "our", "laboratories", "testing", "our", "specialist", "facilities", "licensing", "opportunities", "digital", "creative", "and", "heritage", "medical", "and", "life", "sciences", "engineering", "healthcare", "and", "social", "science", "marine", "agriculture", "and", "environmental", "business", "financial", "and", "legal", "access", "uea", "talent", "mycareercentral", "raise", "your", "profile", "promote", "your", "opportunities", "share", "your", "knowledge", "cpd", "training", "professional", "development", "language", "development", "mba", "programmes", "business", "partnerships", "uea", "companies", "norwich", "research", "park", "norfolk", "network", "associated", "partners", "alumni", "and", "supporters", "go", "to", "alumni", "and", "supporters", "home", "your", "uea", "update", "your", "details", "latest", "news", "where", "are", "they", "now", "benefits", "and", "services", "keep", "learning", "bookshelf", "newsletters", "annual", "magazine", "mailing", "preferences", "archive", "ziggurat", "website", "stay", "involved", "host", "an", "event", "alumni", "groups", "worldwide", "submit", "career", "case", "study", "the", "difference", "campaign", "campaign", "news", "impact", "stories", "make", "gift", "donor", "lists", "alumni", "call", "campaign", "leaving", "legacy", "events", "careers", "contact", "us", "donate", "current", "students", "and", "staff", "about", "us", "go", "to", "about", "us", "home", "visiting", "and", "staying", "getting", "to", "uea", "tourist", "information", "visitor", "accommodation", "campus", "map", "campus", "facilities", "our", "university", "chancellor", "vice", "chancellor", "executive", "team", "university", "structure", "student", "charter", "history", "of", "the", "university", "annual", "reports", "and", "publications", "corporate", "social", "responsibility", "charities", "information", "equality", "and", "diversity", "sustainability", "widening", "participation", "community", "engagement", "freedom", "of", "information", "creating", "headroom", "media", "room", "latest", "news", "media", "experts", "meet", "the", "communications", "team", "information", "for", "student", "journalists", "interview", "guidance", "press", "release", "archive", "fast", "facts", "internal", "communications", "key", "dates", "and", "events", "semester", "dates", "events", "music", "centre", "contact", "us", "vacancies", "contact", "us", "computing", "school", "of", "computing", "sciences", "school", "of", "computing", "sciences", "school", "of", "computing", "sciences", "faculties", "and", "schools", "science", "school", "of", "computing", "sciences", "undergraduate", "degrees", "postgraduate", "taught", "degrees", "research", "degrees", "people", "research", "careers", "and", "employability", "engagement", "and", "outreach", "equality", "and", "athena", "swan", "new", "student", "information", "working", "with", "business", "continuing", "professional", "development", "news", "and", "events", "contact", "us", "current", "students", "alumni", "about", "the", "faculty", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "research", "physics", "fellowships", "graduate", "school", "one", "of", "the", "most", "experienced", "schools", "of", "computing", "sciences", "in", "the", "uk", "one", "of", "the", "most", "experienced", "schools", "of", "computing", "sciences", "in", "the", "uk", "latest", "news", "cmp", "and", "earlham", "researchers", "develop", "new", "phylogenetics", "software", "package", "latest", "events", "cmp", "pgr", "day", "publications", "recently", "published", "publications", "welcome", "to", "the", "school", "of", "computing", "sciences", "were", "founded", "over", "years", "ago", "and", "we", "pride", "ourselves", "on", "teaching", "and", "research", "that", "is", "relevant", "to", "the", "needs", "of", "now", "and", "the", "future", "believe", "that", "we", "learn", "by", "doing", "so", "we", "teach", "using", "practical", "hands", "on", "approach", "in", "combination", "with", "the", "latest", "theories", "our", "graduates", "are", "highly", "employable", "once", "they", "finish", "their", "degrees", "the", "latest", "employment", "figures", "show", "that", "of", "our", "undergraduates", "found", "work", "or", "study", "within", "six", "months", "of", "leaving", "and", "of", "those", "were", "in", "graduate", "level", "jobs", "our", "research", "has", "won", "awards", "and", "prizes", "and", "is", "dominated", "by", "what", "the", "research", "excellence", "framework", "ref", "called", "world", "leading", "internationally", "excellent", "output", "our", "laboratory", "facilities", "are", "outstanding", "offering", "general", "computing", "labs", "specialised", "computer", "graphics", "lab", "an", "electronics", "hardware", "lab", "we", "are", "committed", "to", "the", "principles", "of", "the", "athena", "swan", "charter", "recognises", "and", "celebrates", "good", "practice", "in", "recruiting", "retaining", "and", "promoting", "women", "in", "science", "technology", "engineering", "mathematics", "and", "medicine", "stemm", "in", "higher", "education", "we", "have", "already", "been", "awarded", "bronze", "award", "and", "are", "in", "the", "process", "of", "applying", "for", "silver", "award", "also", "on", "undergraduate", "degrees", "working", "with", "business", "postgraduate", "degrees", "research", "news", "and", "events", "research", "degrees", "popular", "with", "other", "visitors", "undergraduate", "study", "postgraduate", "study", "find", "course", "student", "life", "in", "norwich", "uea", "research", "about", "uea", "study", "with", "us", "uea", "faculty", "pages", "arts", "and", "humanities", "medicine", "and", "health", "sciences", "science", "social", "sciences", "undergraduate", "prospectus", "download", "download", "prospectus", "back", "to", "top", "download", "prospectus", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "uea", "all", "rights", "reserved", "university", "of", "east", "anglia", "norwich", "research", "park", "norwich", "norfolk", "nr", "tj", "uk", "switchboard", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "phd", "phd", "place", "degree", "organised", "into", "three", "computational", "biology", "vision", "speech", "machine", "statistics", "these", "carried", "out", "computational", "biology", "speech", "processing", "vision", "colour", "processing", "mining", "optimisation", "machine", "statistics", "part", "which", "includes", "at", "john", "innes", "sainsbury", "genome", "analysis", "food", "hospital", "trust", "strong", "collaborative", "links", "across", "join", "can", "be", "via", "project", "links", "below", "addition", "performed", "across", "can", "be", "prospective", "supervisors", "whose", "interested", "can", "be", "viewed", "via", "web", "at", "address", "above", "can", "be", "prospective", "enquiries", "admiss", "ac", "further", "at", "it", "anticipated", "majority", "successful", "applicants", "will", "start", "october", "each", "year", "but", "some", "may", "be", "able", "start", "at", "standard", "entry", "points", "january", "april", "july", "directly", "funded", "competitively", "funded", "phd", "projects", "directly", "funded", "projects", "choose", "best", "applicant", "project", "competitively", "funded", "projects", "choose", "best", "applicants", "set", "projects", "usually", "only", "available", "applicants", "covers", "provides", "tax", "stipend", "approximately", "year", "phd", "view", "projects", "why", "why", "offer", "you", "ranked", "nd", "satisfaction", "nss", "offer", "aligned", "aspirations", "inter", "disciplinary", "enable", "you", "understand", "contemporary", "applications", "track", "onto", "topics", "comprises", "expert", "academic", "scientists", "plus", "industry", "you", "guaranteed", "cutting", "edge", "full", "time", "full", "time", "page", "items", "per", "page", "showing", "results", "first", "previous", "next", "last", "title", "bsc", "bsc", "industry", "bsc", "applied", "bsc", "systems", "bsc", "systems", "industry", "bsc", "imaging", "multimedia", "bsc", "imaging", "multimedia", "industry", "beng", "systems", "beng", "systems", "industry", "bsc", "mcomp", "bsc", "mcomp", "bsc", "industry", "page", "items", "per", "page", "showing", "results", "first", "previous", "next", "last", "book", "experience", "post", "docs", "right", "support", "prepare", "right", "support", "prepare", "cent", "secure", "positions", "continue", "academia", "gone", "become", "sales", "executives", "earning", "competitive", "salaries", "whilst", "others", "secured", "positions", "established", "such", "ibm", "aviva", "logica", "program", "analysts", "designers", "managers", "others", "followed", "entrepreneurial", "path", "established", "own", "while", "chose", "continue", "enter", "academia", "professionally", "support", "market", "very", "competitive", "endeavour", "ensure", "receive", "prepare", "them", "transition", "service", "reflect", "skills", "relate", "potential", "give", "run", "invaluable", "workshops", "finding", "techniques", "write", "cv", "effectively", "job", "please", "follow", "according", "interest", "internships", "job", "enter", "login", "external", "please", "postdoc", "positions", "others", "please", "queries", "related", "please", "director", "prof", "gerard", "parr", "seminars", "conferences", "past", "seminar", "archives", "together", "members", "group", "developed", "spectre", "source", "simplifies", "complex", "read", "more", "publish", "date", "success", "elena", "kulinskaya", "pi", "julia", "koricheva", "rhul", "dr", "gillian", "petrokofsky", "oxford", "nerc", "evidence", "synthesis", "pilot", "scheme", "read", "more", "success", "publish", "date", "council", "pioneering", "nnuh", "collaboration", "council", "mrc", "innovative", "collaboration", "between", "mr", "phillips", "ear", "nose", "throat", "consultant", "read", "more", "council", "pioneering", "nnuh", "collaboration", "publish", "date", "dr", "nikoloulopoulos", "was", "invited", "speaker", "second", "second", "meetup", "group", "thursday", "historic", "marble", "hall", "surrey", "street", "read", "more", "dr", "nikoloulopoulos", "was", "invited", "speaker", "second", "publish", "date", "med", "makes", "breakthrough", "prostate", "cancer", "test", "distinguishes", "prostate", "cancer", "from", "developed", "vincent", "moulton", "dr", "bogdan", "luca", "collaborated", "colin", "cooper", "med", "dr", "daniel", "read", "more", "med", "makes", "breakthrough", "prostate", "cancer", "publish", "date", "seminars", "seminars", "date", "th", "nov", "location", "arcy", "thomson", "seminar", "presentation", "vr", "ar", "read", "more", "publish", "date", "twitter", "generate", "signals", "syndromic", "surveillance", "age", "series", "twitter", "generate", "signals", "syndromic", "surveillance", "use", "semi", "supervised", "classification", "identify", "read", "more", "twitter", "generate", "signals", "syndromic", "surveillance", "publish", "date", "vr", "ar", "date", "th", "nov", "location", "jsc", "speaker", "nigel", "institution", "chester", "organiser", "dr", "michal", "mackiewicz", "read", "more", "vr", "ar", "publish", "date", "from", "symbolic", "ultrametrics", "way", "maps", "date", "th", "oct", "location", "speaker", "guillaume", "scholz", "institution", "organiser", "dr", "michal", "mackiewicz", "read", "more", "from", "symbolic", "ultrametrics", "way", "maps", "publish", "date", "series", "classification", "date", "th", "oct", "location", "sci", "maths", "library", "speaker", "dr", "tony", "bagnall", "institution", "email", "read", "more", "series", "classification", "publish", "date", "touch", "touch", "tel", "fax", "cmpmth", "lso", "admissions", "admissions", "role", "name", "head", "professor", "professor", "deputy", "head", "professor", "andy", "professor", "andy", "rudy", "lapeer", "rudy", "lapeer", "innovation", "steven", "hayward", "steven", "hayward", "dan", "smith", "dan", "smith", "katharina", "huber", "katharina", "huber", "richard", "harvey", "richard", "harvey", "manager", "nadia", "mobbs", "nadia", "mobbs", "head", "pa", "sue", "spurgeon", "sue", "spurgeon", "list", "responsibilities", "associate", "tutors", "honorary", "local", "miua", "scientist", "image", "deep", "mirada", "www", "mirada", "com", "seeking", "scientist", "its", "seeking", "candidate", "who", "deep", "cnns", "miua", "scientist", "image", "deep", "miua", "retinal", "ms", "edinburgh", "modelling", "retinal", "vasculature", "biomarker", "discovery", "ms", "studentship", "edinburgh", "application", "deadline", "miua", "retinal", "ms", "edinburgh", "miua", "image", "nottingham", "postdoctoral", "fellow", "nottingham", "this", "holder", "miua", "image", "nottingham", "miua", "position", "edinburgh", "signal", "dynamic", "magnetic", "resonance", "image", "acquisitions", "subtle", "blood", "brain", "barrier", "changes", "small", "vessel", "disease", "primary", "supervisor", "maria", "del", "miua", "position", "edinburgh", "engineer", "assisted", "fetal", "therapy", "ucl", "london", "this", "exciting", "opportunity", "wellcome", "epsrc", "interventional", "surgical", "weiss", "looking", "engineer", "complement", "engineer", "assisted", "fetal", "therapy", "ucl", "london", "tweets", "mth", "common", "edo", "osagie", "abstract", "refers", "form", "uses", "statistical", "algorithms", "detect", "earlier", "than", "investigate", "deliver", "focusing", "initially", "specific", "syndrome", "asthma", "incident", "air", "pollution", "result", "increased", "respiratory", "problems", "outline", "collection", "streaming", "api", "selected", "keywords", "perform", "pre", "collected", "eliminate", "noise", "note", "many", "tweets", "collected", "selected", "keywords", "not", "because", "represent", "chatter", "talk", "awareness", "instead", "suffering", "particular", "condition", "therefore", "tweets", "collect", "reliable", "investigate", "text", "particular", "since", "collected", "without", "needing", "label", "investigate", "emojis", "special", "features", "capturing", "tweet", "tone", "improve", "fore", "big", "poster", "holders", "aldridge", "senior", "mrs", "lucy", "anderson", "lecturer", "nader", "azarmi", "duncan", "bell", "mario", "caccamo", "anyela", "camargo", "rodriguez", "senior", "lecturer", "stephen", "cox", "emeritus", "donard", "de", "cogan", "senior", "overview", "activities", "admin", "joined", "joint", "after", "spending", "two", "biomolecular", "spent", "four", "nobuhiro", "department", "kyoto", "japan", "four", "herman", "berendsen", "department", "groningen", "netherlands", "personal", "japan", "society", "promotion", "jsps", "fellowship", "european", "commission", "programme", "fellowship", "japan", "european", "biotechnology", "programme", "fellowship", "my", "topic", "protein", "protein", "dynamics", "protein", "function", "employ", "variety", "including", "simulation", "methods", "bioinformatics", "focus", "my", "protein", "domain", "movements", "dyndom", "webserver", "dyndom", "foremost", "site", "protein", "domain", "movements", "collaborate", "colleagues", "japan", "jsps", "bridge", "fellowship", "jsps", "furusato", "jsps", "invitation", "fellowship", "japan", "term", "royal", "society", "grant", "colleagues", "japan", "particularly", "my", "long", "term", "collaborator", "akio", "kitao", "molecular", "cellular", "biosciences", "tokyo", "laycock", "haptic", "force", "feedback", "based", "tools", "biomolecular", "interactions", "haptimol", "gavin", "cawley", "protein", "domain", "movements", "background", "hons", "bristol", "diplom", "johannes", "gutenberg", "mainz", "germany", "did", "protein", "secondary", "prediction", "department", "molecular", "scotland", "before", "embarking", "my", "highlighted", "see", "kitao", "monte", "carlo", "sampling", "linear", "inverse", "kinematics", "simulation", "protein", "flexible", "regions", "journal", "chemical", "theory", "computation", "pp", "repository", "article", "iakovou", "laycock", "real", "proximity", "querying", "algorithm", "haptic", "based", "molecular", "docking", "faraday", "discussions", "pp", "repository", "article", "taylor", "cawley", "quantitative", "method", "assignment", "hinge", "shear", "mechanism", "protein", "domain", "movements", "bioinformatics", "pp", "repository", "article", "yura", "interwinding", "nature", "protein", "protein", "interfaces", "implication", "protein", "formation", "bioinformatics", "pp", "repository", "article", "structural", "governing", "domain", "motions", "proteins", "proteins", "function", "genetics", "pp", "repository", "article", "berendsen", "systematic", "domain", "motions", "proteins", "conformational", "change", "citrate", "synthase", "lysozyme", "proteins", "function", "genetics", "pp", "co", "systematic", "domain", "motions", "proteins", "conformational", "change", "citrate", "synthase", "lysozyme", "repository", "article", "kitao", "harmonicity", "anharmonicity", "protein", "dynamics", "normal", "mode", "principal", "component", "proteins", "function", "genetics", "pp", "repository", "article", "see", "highlights", "matthews", "easdon", "kitao", "laycock", "high", "quality", "rendering", "protein", "dynamics", "filling", "mode", "journal", "molecular", "pp", "repository", "article", "milner", "white", "geometrical", "homomeric", "barrels", "helices", "modeling", "amyloid", "protofilaments", "proteins", "function", "bioinformatics", "pp", "repository", "article", "milner", "white", "cover", "volume", "issue", "contribution", "iakovou", "laycock", "virtual", "environment", "docking", "interactions", "rigid", "biomolecules", "haptics", "journal", "chemical", "modeling", "pp", "repository", "article", "iakovou", "laycock", "determination", "locked", "interfaces", "biomolecular", "complexes", "haptimol_rd", "biophysics", "physicobiology", "pp", "repository", "article", "girdlestone", "dyndomd", "webserver", "domain", "movements", "multimeric", "proteins", "journal", "pp", "repository", "article", "iakovou", "laycock", "adaptive", "gpu", "accelerated", "force", "calculation", "interactive", "rigid", "molecular", "docking", "haptics", "journal", "molecular", "pp", "repository", "article", "kitao", "monte", "carlo", "sampling", "linear", "inverse", "kinematics", "simulation", "protein", "flexible", "regions", "journal", "chemical", "theory", "computation", "pp", "repository", "article", "iakovou", "laycock", "real", "proximity", "querying", "algorithm", "haptic", "based", "molecular", "docking", "faraday", "discussions", "pp", "repository", "article", "leader", "al", "shubailly", "milner", "white", "rings", "ribbons", "protein", "structures", "characterization", "helical", "parameters", "ramachandran", "plots", "repeating", "dipeptides", "rings", "ribbons", "protein", "structures", "proteins", "function", "bioinformatics", "pp", "repository", "article", "taylor", "cawley", "quantitative", "method", "assignment", "hinge", "shear", "mechanism", "protein", "domain", "movements", "bioinformatics", "pp", "repository", "article", "taylor", "cawley", "protein", "domain", "movements", "graphs", "plos", "article", "no", "repository", "article", "stocks", "laycock", "forces", "elastic", "models", "large", "biomolecules", "haptic", "feedback", "device", "journal", "aided", "molecular", "design", "pp", "repository", "article", "james", "milner", "white", "simulation", "sheet", "twisted", "sheet", "antiparallel", "nanotube", "parallel", "strands", "implications", "amyloid", "formation", "proteins", "function", "bioinformatics", "pp", "repository", "article", "kitao", "effect", "end", "constraints", "protein", "loop", "kinematics", "biophysical", "journal", "pp", "repository", "article", "laycock", "stocks", "navigation", "exploration", "large", "sets", "haptic", "feedback", "device", "repository", "paper", "stocks", "laycock", "interacting", "biomolecular", "solvent", "accessible", "surface", "haptic", "feedback", "device", "bmc", "structural", "article", "no", "repository", "article", "poornam", "matsumoto", "ishida", "method", "domain", "movements", "large", "biomolecular", "complexes", "proteins", "function", "bioinformatics", "pp", "repository", "article", "qi", "database", "ligand", "induced", "domain", "movements", "enzymes", "bmc", "structural", "article", "no", "repository", "article", "nishima", "qi", "kitao", "dta", "dihedral", "characterization", "effects", "large", "chain", "dihedral", "proteins", "bioinformatics", "pp", "repository", "article", "interests", "area", "my", "concerns", "conformational", "change", "proteins", "protein", "am", "relationship", "two", "various", "methods", "including", "biogeometry", "molecular", "dynamics", "simulation", "bioinformatics", "based", "approaches", "focus", "concerns", "domain", "motions", "enzymes", "molecular", "dynamics", "simulation", "shown", "enzymes", "domain", "locking", "mechanism", "operates", "keeps", "domains", "absence", "functional", "ligand", "exact", "nature", "purpose", "locking", "mechanism", "alcohol", "dehydrogenase", "elucidated", "another", "thread", "my", "domain", "proteins", "concerns", "creation", "database", "protein", "domain", "movements", "based", "my", "dyndom", "see", "http", "dyndom", "foremost", "database", "protein", "domain", "motions", "forms", "bioinformatics", "based", "approaches", "understanding", "protein", "conformational", "change", "little", "known", "secondary", "alpha", "sheet", "predicted", "pauling", "corey", "hardly", "proteins", "however", "poor", "cousin", "rekindled", "amyloid", "diseases", "alzheimer", "parkinson", "huntington", "type", "ii", "diabetes", "prion", "diseases", "bse", "mad", "cow", "calculate", "geometrical", "properties", "strand", "alpha", "sheet", "milner", "white", "geometry", "alpha", "sheet", "implications", "possible", "function", "amyloid", "precursor", "proteins", "proteins", "function", "bioinformatics", "volume", "number", "kitao", "molecular", "dynamics", "simulations", "nad", "induced", "domain", "closure", "horse", "liver", "alcohol", "dehydrogenase", "biophysical", "journal", "volume", "issue", "qi", "lee", "comprehensive", "non", "redundant", "database", "protein", "domain", "movements", "bioinformatics", "volume", "number", "identification", "interactions", "drive", "ligand", "induced", "closure", "five", "enzymes", "classic", "domain", "movements", "journal", "molecular", "volume", "issue", "collaborators", "kitao", "tokyo", "ishida", "japan", "atomic", "energy", "agency", "yura", "ochanomizu", "milner", "white", "glasgow", "danilo", "roccatano", "jakobs", "germany", "bert", "groot", "max", "planck", "biophysical", "laycock", "matumoto", "japan", "atomic", "energy", "agency", "membership", "taylor", "guoying", "qi", "guru", "poornam", "catherine", "snow", "activities", "indicators", "esteem", "japan", "society", "promotion", "bridge", "fellowship", "fy", "week", "networking", "japan", "feb", "regular", "workshop", "molecular", "simulations", "gaeta", "italy", "theory", "simulation", "biomolecular", "nano", "machines", "kobe", "japan", "based", "itbl", "japanese", "atomic", "energy", "agency", "jaea", "kizu", "japan", "liaison", "incorrect", "generated", "november", "click", "get", "fresh", "copy", "bielefeld", "bielefeld", "finishing", "her", "she", "marsden", "massey", "palmerston", "north", "zealand", "beginning", "she", "moved", "sundsvall", "sweden", "she", "discrete", "she", "moved", "uppsala", "sweden", "she", "biometry", "swedish", "agricultural", "linnaeus", "she", "docent", "uppsala", "she", "moved", "united", "kingdom", "she", "aug", "she", "promoted", "she", "member", "mathematical", "lms", "always", "welcomes", "she", "would", "keen", "someone", "assist", "her", "novel", "mathematical", "methodology", "help", "processes", "evolution", "she", "seriously", "consider", "would", "like", "any", "her", "unfortunately", "she", "unlikely", "would", "help", "additional", "contacts", "gambette", "uprooted", "phylogenetic", "networks", "bulletin", "mathematical", "francis", "wu", "bounds", "phylogenetic", "metrics", "mathematical", "pub", "ahead", "print", "steel", "minimum", "triplet", "binary", "phylogenetic", "trees", "mathematical", "pub", "ahead", "print", "gambette", "kelk", "challenge", "reconstructing", "phylogenetic", "networks", "triplets", "clusters", "mathematical", "van", "iersel", "scornavacca", "wu", "reconstructing", "phylogenetic", "networks", "nondense", "binet", "trinet", "algorithmica", "steel", "wu", "folding", "unfolding", "phylogenetic", "trees", "networks", "mathematical", "beyond", "representing", "orthology", "relations", "trees", "algorithmica", "pub", "ahead", "print", "wu", "transforming", "phylogenetic", "networks", "moving", "beyond", "tree", "theoretical", "dress", "koolen", "spillner", "characterizing", "block", "terms", "vertex", "partitions", "australasian", "combinatorics", "linz", "wu", "spaces", "phylogenetic", "networks", "generalized", "nearest", "neighbor", "interchange", "operations", "mathematical", "kettleborough", "distinguished", "minimal", "topological", "lassos", "siam", "discrete", "van", "iersel", "wu", "much", "needed", "infer", "reticulate", "evolutionary", "histories", "kettleborough", "dicks", "roberts", "reconstructing", "super", "trees", "missing", "distances", "lost", "evolution", "popescu", "psiko", "versatile", "tool", "infer", "population", "stratification", "levels", "gwas", "popescu", "harper", "trick", "bancroft", "novel", "population", "inference", "kernel", "pca", "optimization", "psiko", "semple", "wu", "representing", "partitions", "trees", "siam", "discrete", "steel", "reconstructing", "fully", "resolved", "trees", "triplet", "distances", "electronic", "combinatorics", "dress", "steel", "matroid", "phylogenetic", "tree", "discrete", "theoretical", "encoding", "constructing", "nested", "phylogenetic", "networks", "trinets", "algorithmica", "popescu", "lassoing", "corralling", "rooted", "phylogenetic", "trees", "bulletin", "mathematical", "member", "her", "range", "developing", "mathematical", "help", "shed", "light", "processes", "evolution", "combinatorial", "objects", "cluster", "finite", "metric", "spaces", "her", "always", "welcomes", "she", "would", "keen", "someone", "assist", "her", "novel", "mathematical", "methodology", "help", "processes", "evolution", "she", "seriously", "consider", "would", "like", "any", "her", "unfortunately", "she", "unlikely", "would", "help", "encoding", "constructing", "nested", "phylogenetic", "networks", "trinets", "algorithmica", "gambette", "encodings", "phylogenetic", "networks", "bounded", "mathematical", "dress", "steel", "phylogenetic", "tree", "basic", "shellings", "mathematical", "dress", "koolen", "spillner", "basic", "phylogenetic", "combinatorics", "cambrige", "member", "editorial", "board", "mathematical", "member", "committee", "member", "committee", "national", "evolutionary", "center", "nescent", "durham", "north", "carolina", "usa", "aug", "participant", "iplant", "grand", "challenges", "entitled", "assembling", "tree", "plant", "iptol", "arizona", "usa", "isaac", "newton", "mathematical", "cambridge", "sept", "dec", "her", "invitations", "speak", "include", "phylogenetic", "networks", "lorentz", "center", "motifs", "networks", "phylogenies", "schloss", "dagstuhl", "directions", "tropical", "manchester", "jan", "tropical", "saarbruecken", "she", "champion", "organizing", "know", "lots", "do", "arrive", "worry", "here", "guide", "through", "necessary", "administrative", "tasks", "giving", "insight", "alternatively", "section", "clicking", "if", "questions", "arrival", "if", "question", "postgraduates", "intriguing", "copula", "killed", "wall", "he", "pointed", "limitations", "copula", "dimensional", "recommended", "vine", "factor", "copulas", "when", "dependence", "among", "extreme", "values", "inferences", "multivariate", "tail", "probabilities", "until", "march", "physician", "gastroenterologist", "ipswich", "ipswich", "twice", "bsg", "hopkins", "endoscopy", "prize", "made", "college", "surgeons", "hunterian", "his", "endoscopic", "safety", "sedation", "monitoring", "invented", "oxygenating", "mouthguard", "urea", "breath", "endoscope", "system", "worked", "closely", "bt", "peter", "cochrane", "martlesham", "tele", "his", "unit", "doctor", "gastroenterology", "chaired", "bsg", "sedation", "monitoring", "later", "chaired", "party", "informed", "consent", "reviewer", "several", "journals", "himself", "peer", "reviewed", "original", "papers", "diverse", "biliary", "lipids", "gallstone", "dissolution", "hepatic", "drug", "metabolism", "monoterpenes", "atheroma", "ibs", "helicobacter", "pylori", "telemedicine", "endoscope", "well", "iv", "sedation", "safety", "during", "endoscopy", "june", "worked", "gastroenterologist", "sunderland", "srh", "sunderland", "bsg", "hopkins", "endoscopy", "prize", "his", "colonoscopy", "continues", "carry", "fixed", "nhs", "clinical", "sessions", "both", "ipswich", "endoscopy", "unit", "designated", "college", "surgeons", "england", "endoscopic", "endoscopic", "convenor", "colonoscopy", "mrcs", "md", "msc", "frcp", "lond", "edin", "trained", "barts", "qualifying", "double", "honours", "mb", "bs", "finals", "same", "obtained", "his", "mrcs", "lrcp", "passed", "his", "mrcp", "his", "house", "physician", "sho", "posts", "barts", "brompton", "rpgms", "hammersmith", "registrar", "appointment", "hermon", "dowling", "rpgms", "obtained", "msc", "well", "conducting", "early", "gallstone", "dissolution", "chenodeoxcholic", "acid", "hon", "registrar", "st", "bartholomews", "sir", "anthony", "dawson", "obtained", "his", "md", "thesis", "same", "michael", "langman", "therapeutics", "ryalat", "emmens", "hulse", "rahamneh", "fisher", "evaluation", "particle", "swarm", "segmentation", "advances", "proceedings", "icss", "springer", "publishing", "isbn", "hulse", "scrase", "tam", "isherwood", "mortimore", "emmens", "patman", "towards", "production", "radiotherapy", "treatment", "shells", "printers", "derived", "dicom", "ct", "mri", "preclinical", "feasibility", "radiotherapy", "corps", "mortimore", "finkel", "micro", "computed", "tomography", "cad", "printing", "reconstruct", "incomplete", "century", "cantonese", "chess", "pieces", "cultural", "saad", "la", "iglesia", "labelling", "effort", "su", "fisher", "wolczowski", "burn", "gao", "towards", "emg", "controlled", "prosthetic", "hand", "electromagnetic", "positioning", "system", "ieee", "transactions", "instrumentation", "measurement", "lord", "gray", "quine", "bowles", "romaya", "la", "iglesia", "reynolds", "rayward", "sedation", "gastrointestinal", "endoscopic", "procedures", "elderly", "safer", "still", "nearly", "safe", "enough", "british", "gastroenterology", "heatley", "rowland", "rowland", "hegarty", "dodd", "calvert", "scott", "rae", "laptop", "dicom", "viewer", "theatre", "procedures", "multi", "mdt", "meetings", "networked", "saad", "la", "iglesia", "comparison", "documents", "classify", "advances", "springer", "berlin", "heidelberg", "isbn", "chapter", "su", "wolczowski", "fisher", "burn", "gao", "towards", "emg", "controlled", "prosthetic", "hand", "electromagnetic", "positioning", "system", "renehan", "painter", "rowland", "shalet", "bowel", "length", "complexity", "patients", "acromegaly", "undergoing", "screening", "colonoscopy", "clinical", "endocrinology", "reynolds", "la", "iglesia", "cook", "tighe", "sedated", "gender", "individual", "likely", "decision", "reynolds", "la", "iglesia", "sheikh", "cook", "tighe", "monitoring", "colonoscopy", "rates", "detecting", "sedation", "regional", "sheikh", "reynolds", "la", "iglesia", "tighe", "used", "rapidly", "interrogate", "endoscopy", "colonoscopy", "failure", "rates", "criteria", "should", "used", "define", "berens", "stomach", "intestine", "colon", "tissue", "discriminators", "wireless", "capsule", "endoscopy", "cameron", "powell", "baldwin", "jones", "williams", "helicobacter", "pylori", "antibiotic", "resistance", "eradication", "rates", "suffolk", "microbiology", "hancock", "nylander", "abro", "burn", "bicker", "allen", "colonoscopy", "hoken", "colon", "model", "simulator", "torque", "steering", "rae", "rowland", "laptop", "dicom", "reader", "mdt", "meetings", "district", "gut", "abstracts", "bmj", "preparation", "premedication", "endoscopy", "sedation", "gastrointestinal", "endoscopy", "textbook", "sedation", "gastrointestinal", "nurse", "associates", "late", "chapter", "tan", "mansfield", "modify", "existing", "automatic", "recognition", "reliably", "safely", "monitor", "respiration", "patients", "sedated", "propofol", "maintains", "british", "telecom", "currently", "sunderland", "electrical", "newcastle", "class", "physical", "ph", "solid", "state", "doctoral", "materials", "semiconductor", "devices", "industrial", "power", "semiconductors", "trinity", "dublin", "nijmegen", "birmingham", "universities", "solid", "state", "materials", "modes", "devices", "components", "latter", "transmission", "line", "matrix", "tlm", "leads", "sub", "tlm", "numerical", "iee", "advisor", "iee", "numerical", "review", "editor", "editor", "gordon", "breach", "monograph", "electrocomponent", "proposals", "send", "him", "enterprise", "enterprise", "sustainable", "relationships", "businesses", "commitment", "close", "commercial", "company", "sysco", "often", "commercial", "mean", "step", "changing", "recent", "examples", "enterprise", "runs", "businesses", "bespoke", "syrinix", "urban", "lingua", "animgen", "meta", "content", "lang", "en", "gb", "description", "technologies", "played", "important", "supporting", "products", "hospitals", "procedure", "rehearsal", "rehabilitation", "areas", "illustrated", "changed", "silicon", "workstation", "present", "affordable", "htc", "vive", "microsoft", "hololens", "possibilities", "highlight", "active", "areas", "exist", "gain", "commercialisation", "ideas", "held", "chair", "bangor", "prior", "charge", "visualization", "silicon", "inc", "zeneca", "pharmaceuticals", "wales", "visual", "rivic", "nischr", "advanced", "visualization", "satava", "acknowledge", "accomplishments", "field", "visualization", "association", "learned", "wales", "flsw", "nigeljohn", "org", "collaborations", "wide", "wide", "housed", "thompson", "dart", "physically", "located", "dart", "promotes", "integrative", "spanning", "hierarchy", "ecosystem", "carrying", "dart", "develops", "nrp", "nrp", "represents", "largest", "single", "concentration", "plants", "diet", "dart", "biologists", "nrp", "institutions", "collaborations", "proposed", "initiative", "targets", "gaps", "lack", "aspects", "reviews", "insufficient", "stakeholder", "reduces", "usefulness", "produced", "making", "management", "times", "atsc", "delivered", "matthew", "ladd", "administrator", "phone", "heidi", "prada", "developer", "analyst", "phone", "binoop", "pulikkottil", "technical", "officer", "phone", "russell", "administrator", "phone", "trollope", "technician", "phone", "catch", "net", "dearnley", "jo", "mark", "drew", "robin", "forrest", "paul", "fretter", "david", "giles", "glauert", "goldstein", "alexander", "hamilton", "martin", "howard", "quantification", "un", "expected", "investigated", "integrated", "different", "modalities", "histopathology", "images", "colorectal", "parametric", "chronic", "kidney", "unique", "nihr", "biomedical", "pathology", "node", "talented", "energetic", "motivated", "nearing", "completion", "discipline", "cnn", "rnn", "gan", "etc", "encouraged", "expected", "programming", "python", "matlab", "contract", "period", "currentvacancies", "showcase", "packages", "showcase", "packages", "packages", "listed", "analyse", "determine", "axes", "bending", "residues", "conformations", "analyse", "determine", "axes", "conformations", "isas", "search", "water", "channels", "pockets", "flexibility", "enm", "mechanical", "biomolecule", "predict", "comparing", "zclass", "takes", "input", "databank", "pdb", "file", "converts", "voxelised", "then", "rapid", "comparisons", "shapes", "rna", "srna", "workbench", "srna", "workbench", "allows", "users", "analyse", "generation", "sequencing", "rna", "mifold", "mifold", "toolbox", "mutual", "measures", "display", "pseudoknots", "mirplex", "mirplex", "microrna", "throughput", "sequencing", "requires", "rna", "datasets", "input", "growth", "bangham", "analyse", "shapes", "petals", "leaves", "faces", "aamtoolbox", "aamtoolbox", "enables", "user", "analyse", "shape", "collections", "similar", "growth", "organs", "gftbox", "gftbox", "implementation", "growing", "polarised", "gene", "activity", "growth", "shapes", "analyse", "marked", "clones", "warp", "organ", "shape", "sector", "toolbox", "aamtoolbox", "enables", "user", "analyse", "shape", "collections", "similar", "speed", "quantify", "png", "stacks", "omero", "volviewer", "volviewer", "opengl", "qt", "provide", "user", "friendly", "interactively", "quantify", "ccd", "ccd", "java", "selection", "core", "collections", "taxa", "germplasm", "collections", "intended", "capture", "genetic", "input", "dataset", "comrit", "comrit", "written", "polymake", "extension", "compute", "realisations", "flatnj", "flatnj", "flatnetjoining", "fro", "split", "allow", "interior", "vertices", "labelled", "being", "almost", "planar", "lasso", "lasso", "heuristic", "weighted", "partial", "distance", "under", "assumption", "satisfy", "clock", "assumption", "java", "osf", "builder", "osf", "builder", "allows", "introgression", "occurring", "lineages", "padre", "padre", "java", "labelled", "qnet", "qnet", "written", "java", "generating", "quartet", "quasidec", "decomposition", "quasi", "median", "graph", "superq", "superq", "written", "java", "computes", "partial", "trilonet", "trilonet", "created", "construct", "dna", "sequence", "visrd", "visrd", "allowing", "graphical", "inspection", "sequence", "alignment", "primarily", "intended", "detection", "recombination", "recombination", "breakpoints", "viralnet", "viralnet", "estimating", "reticulated", "mixed", "populations", "conservation", "specsel", "specsel", "species", "selection", "written", "java", "computes", "indicator", "species", "pool", "species", "objective", "niche", "svm", "toolbox", "beta", "version", "implementing", "vector", "denitrification", "denitrification", "bacteria", "biography", "jrwg", "following", "languages", "dataflow", "computers", "became", "appointed", "dean", "disciplines", "represented", "combined", "unified", "culture", "significant", "increase", "took", "income", "around", "received", "ba", "returned", "studied", "relational", "databases", "alharbi", "mayhew", "usability", "human", "interaction", "game", "entertainment", "mccsis", "iadis", "safar", "handbook", "mouton", "gruyer", "hanke", "matthes", "regen", "storz", "worseck", "elliott", "kennaway", "timing", "avatars", "farooq", "load", "distribution", "worlds", "elliott", "bueno", "kennaway", "integration", "synthetic", "sl", "animation", "avatars", "corpus", "annotation", "jennings", "elliott", "kennaway", "requirements", "signing", "avatar", "efthimiou", "fotinea", "vogler", "hanke", "bowden", "braffort", "collet", "maragos", "segouat", "universal", "human", "interaction", "addressing", "farooq", "ara", "aggregate", "region", "resource", "minimisation", "load", "distribution", "worlds", "farooq", "hierarchical", "nodes", "johnum", "infrastructure", "scalable", "consistent", "worlds", "elliott", "kennaway", "marshall", "safar", "linguistic", "avatar", "universal", "arnold", "haegler", "kevelham", "magnenat", "thalman", "maim", "maupu", "papagiannakis", "thalmann", "yersin", "rodiguez", "echvarria", "populating", "environments", "humans", "efthimiou", "fotinea", "emerging", "deaf", "universal", "kennaway", "zwitserlood", "providing", "signed", "internet", "synthesized", "animation", "acm", "human", "interaction", "mcalpine", "jennings", "thomas", "rabin", "incorporating", "avatar", "signing", "assessment", "echavarria", "morris", "moore", "arnold", "jennings", "effective", "immersive", "environments", "elliot", "tryggvason", "sheard", "vanessa", "deaf", "hearing", "disability", "khasidashvili", "conflict", "reduction", "elliott", "kennaway", "scripted", "human", "echavarria", "genereux", "arnold", "multilingual", "city", "guides", "kesner", "khasidashvili", "expression", "reduction", "extensions", "cycles", "steps", "road", "infinity", "essays", "dedicated", "willem", "klop", "occasion", "birthday", "verlag", "humans", "theme", "running", "contributions", "concurrent", "computations", "executed", "sequentially", "constrained", "order", "concern", "frameworks", "lead", "approached", "conviction", "sound", "basis", "essential", "hence", "focussed", "languages", "architectures", "intermediate", "foundations", "declarative", "languages", "relational", "languages", "explicit", "concurrency", "intermediate", "representations", "central", "visicast", "xml", "humans", "kennaway", "zwitserlood", "providing", "signed", "internet", "synthesized", "animation", "acm", "human", "interaction", "elliott", "tryggvason", "sheard", "vanessa", "deaf", "hearing", "disability", "khasidashvili", "conflict", "reduction", "khasidashvili", "relating", "conflict", "stable", "transistions", "redex", "tutorial", "presentations", "cvhi", "kufstein", "vssm", "ghent", "symposium", "gesture", "expressive", "characters", "aisb", "coordinator", "socrates", "experiences", "graduating", "edward", "johnson", "built", "gained", "carve", "ecommerce", "just", "seen", "benefit", "edward", "johnson", "significantly", "helped", "chosen", "side", "elements", "conversation", "side", "accountancy", "translated", "vacation", "rd", "katrina", "lowles", "hvb", "designing", "floor", "plan", "inspired", "rd", "katrina", "started", "hvb", "graduating", "unicredit", "katrina", "lowles", "playing", "every", "solving", "figuring", "slickest", "extensible", "solution", "requirement", "grasped", "infinite", "versatility", "teaches", "thinking", "gives", "confidence", "pantelis", "unforgettable", "me", "especially", "comes", "games", "opened", "me", "module", "moreover", "thanks", "lecturers", "games", "competition", "star", "came", "certainly", "helping", "me", "pursuing", "journey", "magnificent", "studios", "finally", "myself", "programmer", "neon", "play", "ltd", "mobile", "studios", "mohammed", "obaid", "siddiqui", "great", "memories", "thanks", "professors", "helped", "me", "biocon", "india", "brought", "added", "value", "mention", "exposure", "given", "me", "dissertation", "prepared", "me", "quickly", "recommend", "summary", "summary", "introduction", "child", "union", "barcelona", "foreign", "prove", "true", "there", "rest", "situation", "looks", "psycholinguistics", "exploit", "abilities", "there", "frequent", "daily", "native", "classroom", "appeal", "styles", "valid", "children", "fostered", "countries", "aim", "signers", "adventures", "hocus", "lotus", "psycholinguistic", "echoes", "children", "manipulate", "rather", "repeat", "rote", "sequences", "skill", "rarely", "witnessed", "conventional", "classroom", "heart", "concept", "does", "subject", "rather", "shared", "although", "younger", "children", "aged", "classroom", "classes", "older", "pupils", "cannot", "stand", "circles", "rooms", "require", "appropriate", "cannot", "attend", "spend", "required", "adequate", "animated", "character", "viataal", "pioneers", "animated", "public", "esign", "designed", "foreign", "europe", "hampered", "shortage", "designed", "classroom", "wishing", "conversational", "foreign", "older", "children", "olds", "re", "near", "situation", "classroom", "meets", "older", "children", "whom", "hocus", "lotus", "resources", "designed", "motivation", "impaired", "pupils", "met", "appropriate", "combining", "integrate", "children", "lingual", "fulfils", "urgent", "need", "appropriate", "resources", "minority", "status", "story", "siggi", "luna", "designed", "testaluna", "speaking", "animated", "sequences", "story", "testaluna", "sequences", "designed", "video", "sequences", "trialled", "france", "holland", "positive", "covered", "french", "dutch", "portuguese", "extended", "purchased", "linguasign", "county", "stichting", "viataal", "sint", "michielsgestel", "nl", "testaluna", "srl", "milano", "academie", "toulouse", "academique", "du", "tarn", "et", "garrone", "gaillac", "toulouse", "fr", "december", "eye", "embryonic", "origins", "anatomical", "nervous", "amenable", "invasive", "optical", "coherence", "thickness", "nerve", "fibres", "retina", "axonal", "loss", "thinning", "layer", "revealed", "lower", "density", "vessels", "optic", "nerve", "fundus", "suggests", "differences", "venules", "peripheral", "retina", "neurodegeneration", "neurovascular", "utility", "tracking", "combine", "build", "unparalleled", "previously", "attempted", "smallest", "discernible", "vessels", "macula", "arcades", "optic", "nerve", "branches", "extending", "periphery", "probe", "vascular", "pathogenesis", "combine", "neuroretinal", "anatomy", "sprint", "mnd", "motor", "neurone", "multiple", "sclerosis", "encompassing", "aberdeen", "dundee", "andrews", "budding", "mnd", "professionals", "edinburghneuroscience", "ed", "edneurophd", "sprint", "mndms", "regarding", "edinburghneuroscience", "ed", "sprint", "edi", "https", "findaphd", "projectdetails", "aspx", "pjid", "nurunnahar", "akter", "miss", "aliya", "aleryani", "alia", "algurashi", "abeer", "zahyah", "tahani", "alkhudaydi", "abdulaziz", "almajed", "saleh", "alyahyan", "salma", "alzahrani", "miss", "georgia", "amor", "tutor", "ilyas", "bakbergenuly", "virginia", "barnard", "assistant", "begun", "bird", "tutor", "bird", "farrash", "wang", "heterogeneous", "ensemble", "imaginary", "scene", "kdir", "dissimilarities", "generalization", "dissimilarities", "indicate", "homogeneity", "resemblance", "threeway", "arise", "arbitrary", "symbols", "notion", "introduced", "b\u00f6cker", "characterized", "certain", "point", "conditions", "aaron", "bostrom", "ellen", "bowler", "renato", "busatto", "figueiredo", "frank", "carver", "padma", "chutoo", "prestigious", "pathway", "supports", "initial", "diagnostics", "successfully", "prototype", "assessing", "dizziness", "episodes", "reduce", "unnecessary", "gp", "visits", "tests", "scans", "thus", "reducing", "burden", "improving", "dizziness", "prototype", "healthy", "volunteers", "tested", "dizziness", "commented", "commented", "demonstrates", "direct", "interplay", "becoming", "ever", "strive", "interventions", "reduce", "burden", "optimise", "treatments", "forefront", "interface", "look", "forward", "planned", "smart", "supported", "proof", "audio", "link", "feel", "discuss", "outside", "alternative", "sources", "firstly", "physicist", "began", "government", "radar", "establishment", "qinetiq", "malvern", "researched", 