["school", "of", "computing", "sciences", "uea", "vacancies", "contact", "us", "sign", "in", "uea", "students", "and", "staff", "everyone", "else", "main", "menu", "home", "study", "with", "us", "course", "finder", "request", "prospectus", "mini", "open", "day", "applying", "accommodation", "scholarships", "fees", "and", "funding", "visit", "us", "student", "life", "advice", "for", "future", "students", "mature", "students", "your", "future", "career", "ask", "uea", "new", "students", "course", "finder", "accommodation", "applying", "request", "prospectus", "postgraduate", "taught", "degrees", "fees", "scholarships", "and", "loans", "visit", "us", "postgraduate", "research", "degrees", "phds", "studentships", "research", "themes", "fees", "and", "funding", "how", "to", "apply", "meet", "our", "students", "your", "country", "eu", "students", "studying", "in", "the", "uk", "applying", "as", "an", "international", "student", "fees", "and", "funding", "visit", "us", "accommodation", "international", "families", "international", "summer", "school", "malaysia", "international", "office", "foundation", "and", "diploma", "programmes", "international", "programmes", "contact", "us", "foundation", "courses", "cpd", "summer", "schools", "free", "online", "learning", "parents", "teachers", "young", "people", "incoming", "outgoing", "contact", "us", "research", "research", "themes", "explore", "uea", "research", "postgraduate", "research", "about", "uea", "research", "research", "performance", "fellowships", "faculties", "and", "schools", "art", "media", "and", "american", "studies", "history", "interdisciplinary", "institute", "for", "the", "humanities", "literature", "drama", "and", "creative", "writing", "politics", "philosophy", "language", "and", "communication", "studies", "graduate", "school", "health", "sciences", "norwich", "medical", "school", "centre", "for", "interprofessional", "practice", "continuing", "professional", "development", "graduate", "school", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "computing", "sciences", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "physics", "graduate", "school", "economics", "education", "and", "lifelong", "learning", "geography", "international", "development", "law", "norwich", "business", "school", "psychology", "social", "work", "graduate", "school", "business", "sponsored", "research", "knowledge", "transfer", "partnerships", "gis", "consulting", "consultancy", "case", "studies", "conference", "space", "our", "laboratories", "testing", "our", "specialist", "facilities", "digital", "creative", "and", "heritage", "medical", "and", "life", "sciences", "engineering", "healthcare", "and", "social", "science", "marine", "agriculture", "and", "environmental", "business", "financial", "and", "legal", "mycareercentral", "raise", "your", "profile", "promote", "your", "opportunities", "share", "your", "knowledge", "professional", "development", "language", "development", "mba", "programmes", "uea", "companies", "norwich", "research", "park", "norfolk", "network", "associated", "partners", "alumni", "and", "supporters", "update", "your", "details", "latest", "news", "where", "are", "they", "now", "benefits", "and", "services", "keep", "learning", "bookshelf", "mailing", "preferences", "archive", "ziggurat", "website", "host", "an", "event", "alumni", "groups", "worldwide", "submit", "career", "case", "study", "campaign", "news", "impact", "stories", "make", "gift", "donor", "lists", "alumni", "call", "campaign", "leaving", "legacy", "current", "students", "and", "staff", "about", "us", "getting", "to", "uea", "tourist", "information", "visitor", "accommodation", "campus", "map", "campus", "facilities", "chancellor", "vice", "chancellor", "executive", "team", "university", "structure", "student", "charter", "history", "of", "the", "university", "annual", "reports", "and", "publications", "charities", "information", "equality", "and", "diversity", "sustainability", "widening", "participation", "community", "engagement", "freedom", "of", "information", "creating", "headroom", "latest", "news", "media", "experts", "meet", "the", "communications", "team", "information", "for", "student", "journalists", "interview", "guidance", "press", "release", "archive", "fast", "facts", "internal", "communications", "semester", "dates", "events", "music", "centre", "vacancies", "contact", "us", "computing", "school", "of", "computing", "sciences", "faculties", "and", "schools", "science", "school", "of", "computing", "sciences", "undergraduate", "degrees", "postgraduate", "taught", "degrees", "research", "degrees", "people", "research", "careers", "and", "employability", "engagement", "and", "outreach", "equality", "and", "athena", "swan", "new", "student", "information", "working", "with", "business", "continuing", "professional", "development", "news", "and", "events", "contact", "us", "current", "students", "alumni", "about", "the", "faculty", "actuarial", "sciences", "biological", "sciences", "biochemistry", "chemistry", "engineering", "environmental", "sciences", "geography", "mathematics", "natural", "sciences", "pharmacy", "research", "physics", "fellowships", "graduate", "school", "latest", "news", "cmp", "and", "earlham", "researchers", "develop", "new", "phylogenetics", "software", "package", "latest", "events", "visual", "speech", "synthesis", "using", "dynamic", "visemes", "and", "deep", "learning", "architectures", "publications", "recently", "published", "publications", "welcome", "to", "the", "school", "of", "computing", "sciences", "were", "founded", "over", "years", "ago", "and", "we", "pride", "ourselves", "on", "teaching", "and", "research", "that", "is", "relevant", "to", "the", "needs", "of", "now", "and", "the", "future", "believe", "that", "we", "learn", "by", "doing", "so", "we", "teach", "using", "practical", "hands", "on", "approach", "in", "combination", "with", "the", "latest", "theories", "our", "graduates", "are", "highly", "employable", "once", "they", "finish", "their", "degrees", "the", "latest", "employment", "figures", "show", "that", "of", "our", "undergraduates", "found", "work", "or", "study", "within", "six", "months", "of", "leaving", "and", "of", "those", "were", "in", "graduate", "level", "jobs", "our", "research", "has", "won", "awards", "and", "prizes", "and", "is", "dominated", "by", "what", "the", "research", "excellence", "framework", "ref", "called", "world", "leading", "internationally", "excellent", "output", "our", "laboratory", "facilities", "are", "outstanding", "offering", "general", "computing", "labs", "specialised", "computer", "graphics", "lab", "an", "electronics", "hardware", "lab", "we", "are", "committed", "to", "the", "principles", "of", "the", "athena", "swan", "charter", "recognises", "and", "celebrates", "good", "practice", "in", "recruiting", "retaining", "and", "promoting", "women", "in", "science", "technology", "engineering", "mathematics", "and", "medicine", "stemm", "in", "higher", "education", "we", "have", "already", "been", "awarded", "bronze", "award", "and", "are", "in", "the", "process", "of", "applying", "for", "silver", "award", "also", "on", "undergraduate", "degrees", "working", "with", "business", "postgraduate", "degrees", "research", "news", "and", "events", "research", "degrees", "undergraduate", "study", "postgraduate", "study", "find", "course", "student", "life", "in", "norwich", "uea", "research", "about", "uea", "study", "with", "us", "arts", "and", "humanities", "medicine", "and", "health", "sciences", "science", "social", "sciences", "download", "prospectus", "back", "to", "top", "download", "prospectus", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "uea", "all", "rights", "reserved", "university", "of", "east", "anglia", "norwich", "research", "park", "norwich", "norfolk", "nr", "tj", "uk", "switchboard", "accessibility", "legal", "statements", "cookie", "policy", "data", "protection", "role", "name", "email", "head", "professor", "gerard", "parr", "professor", "gerard", "parr", "deputy", "head", "professor", "andy", "professor", "andy", "director", "admissions", "dr", "rudy", "lapeer", "dr", "rudy", "lapeer", "director", "prof", "gerard", "parr", "prof", "gerard", "parr", "director", "innovation", "dr", "steven", "hayward", "dr", "steven", "hayward", "director", "dr", "dan", "smith", "dr", "dan", "smith", "director", "pgr", "dr", "katharina", "huber", "dr", "katharina", "huber", "director", "prof", "vincent", "moulton", "prof", "vincent", "moulton", "manager", "nadia", "mobbs", "nadia", "mobbs", "head", "pa", "sue", "spurgeon", "sue", "spurgeon", "full", "list", "responsibilities", "academic", "support", "associate", "tutors", "other", "academic", "honorary", "local", "support", "key", "holders", "overview", "activities", "admin", "obtained", "msc", "mechanical", "distinction", "at", "college", "ghent", "belgium", "july", "his", "first", "job", "was", "production", "engineer", "at", "volvo", "cars", "europe", "ghent", "he", "worked", "three", "he", "moved", "academia", "took", "up", "post", "engineer", "at", "department", "informatics", "ghent", "rug", "meanwhile", "he", "embarked", "part", "time", "msc", "degree", "which", "he", "completed", "distinction", "he", "was", "then", "offered", "position", "at", "cambridge", "funded", "project", "euro", "punch", "which", "involved", "prediction", "adverse", "pregnancy", "outcomes", "from", "clinical", "he", "started", "phd", "at", "department", "cambridge", "funded", "epsrc", "which", "he", "successfully", "completed", "he", "was", "subsequently", "offered", "senior", "fellowship", "at", "department", "bio", "at", "college", "london", "ucl", "epsrc", "funded", "project", "augmented", "reality", "surgical", "navigation", "casspar", "he", "worked", "consultant", "ucl", "based", "company", "mtt", "he", "was", "appointed", "lecturer", "at", "year", "he", "received", "he", "was", "promoted", "position", "senior", "lecturer", "follow", "this", "link", "phd", "but", "feel", "me", "discuss", "projects", "outside", "these", "areas", "alternative", "sources", "gerikhanov", "audinis", "based", "simulation", "vacuum", "extraction", "during", "childbirth", "repository", "paper", "jeffrey", "dao", "garc\u00eda", "chen", "shickell", "rowland", "philpott", "passive", "coordinate", "measurement", "arm", "motion", "tracking", "rigid", "endoscope", "augmented", "reality", "image", "guided", "surgery", "journal", "robotics", "assisted", "surgery", "pp", "text", "repository", "article", "audinis", "gerikhanov", "dupuis", "based", "simulation", "obstetric", "forceps", "placement", "image", "assisted", "intervention", "miccai", "th", "boston", "ma", "usa", "september", "proceedings", "part", "ii", "springer", "publishing", "pp", "isbn", "text", "contribution", "gasson", "karri", "hyperelastic", "finite", "element", "model", "human", "skin", "interactive", "real", "time", "surgical", "simulation", "ieee", "transactions", "biomedical", "pp", "text", "repository", "article", "shah", "rowland", "optimised", "radial", "basis", "function", "algorithm", "non", "rigid", "registration", "images", "computers", "biology", "pp", "text", "repository", "article", "gasson", "karri", "simulating", "plastic", "surgery", "from", "human", "skin", "tensile", "tests", "through", "hyperelastic", "finite", "element", "models", "real", "time", "haptics", "progress", "biophysics", "molecular", "biology", "pp", "text", "repository", "article", "shah", "rowland", "non", "rigid", "registration", "image", "image", "guided", "surgery", "repository", "paper", "gasson", "fitting", "hyperelastic", "material", "models", "stress", "strain", "from", "vitro", "experiment", "human", "skin", "repository", "paper", "gonzalez", "garcia", "evaluation", "photo", "consistency", "intra", "operative", "registration", "image", "enhanced", "surgical", "navigation", "iesn", "system", "proceedings", "image", "understanding", "analysis", "miua", "pp", "repository", "article", "gonzalez", "garcia", "photo", "consistency", "intra", "operative", "registration", "augmented", "reality", "based", "surgical", "navigation", "repository", "paper", "gonzalez", "garcia", "augmented", "reality", "based", "surgical", "navigation", "system", "minimally", "invasive", "surgery", "repository", "paper", "shah", "rowland", "non", "rigid", "registration", "image", "repository", "paper", "chen", "gonzalez", "linney", "alusi", "image", "enhanced", "surgical", "navigation", "endoscopic", "sinus", "surgery", "evaluating", "calibration", "registration", "tracking", "journal", "robotics", "assisted", "surgery", "pp", "text", "repository", "article", "chen", "brief", "account", "image", "enhanced", "surgical", "navigation", "iesn", "repository", "paper", "rowland", "non", "rigid", "registration", "images", "comparing", "thin", "plate", "biharmonic", "splines", "repository", "paper", "chen", "gonzalez", "garcia", "intra", "operative", "registration", "image", "enhanced", "endoscopic", "sinus", "surgery", "photo", "consistency", "mmvr", "proceedings", "informatics", "pp", "repository", "article", "gasson", "vitro", "skin", "tissue", "experiment", "increased", "realism", "surgery", "simulations", "mmvr", "proceedings", "informatics", "pp", "repository", "article", "heatley", "rowland", "bell", "rowland", "hegarty", "dodd", "calvert", "scott", "rae", "laptop", "based", "dicom", "viewer", "theatre", "procedures", "multi", "site", "mdt", "meetings", "networked", "training", "repository", "paper", "marsland", "based", "animation", "trotting", "horse", "virtual", "environment", "text", "mechanical", "model", "simulation", "obstetric", "forceps", "virtual", "augmented", "environment", "meets", "virtual", "reality", "magical", "next", "becomes", "iop", "pp", "isbn", "repository", "chapter", "my", "interests", "visualisation", "surgical", "navigation", "simulation", "simulation", "biomechanics", "broader", "context", "this", "encompasses", "animation", "vision", "mechanics", "virtual", "augmented", "reality", "vr", "ar", "finite", "element", "analysis", "fea", "numerical", "methods", "below", "number", "links", "projects", "surgical", "navigation", "developed", "platform", "arview", "image", "enhanced", "augmented", "reality", "surgical", "navigation", "this", "particular", "aimed", "at", "ent", "ear", "nose", "throat", "surgery", "stereoscopic", "surgical", "microscope", "rigid", "sinus", "endoscope", "used", "intra", "operative", "imaging", "devices", "visualisation", "collaboration", "roger", "rowland", "from", "rmr", "systems", "developed", "dview", "which", "solution", "aimed", "at", "rendering", "post", "processing", "image", "from", "different", "modalities", "ray", "ct", "mri", "pet", "this", "ongoing", "project", "additional", "features", "frequently", "added", "surgical", "simulation", "use", "advanced", "solutions", "acceleration", "explicit", "finite", "element", "fe", "algorithms", "haptic", "feedback", "simulate", "surgery", "procedures", "this", "context", "performed", "series", "vitro", "experiments", "human", "skin", "assess", "its", "hyper", "visco", "elastic", "properties", "human", "childbirth", "biomechanics", "studied", "fetal", "moulding", "finite", "element", "analysis", "more", "investigated", "effect", "forceps", "delivery", "fetal", "biomechanics", "shoulder", "dystocia", "vehicle", "dynamics", "vpex", "trotting", "horse", "part", "group", "selected", "chen", "gonzalez", "linney", "alusi", "image", "enhanced", "surgical", "navigation", "endoscopic", "sinus", "surgery", "evaluating", "calibration", "registration", "tracking", "journal", "robotics", "assisted", "surgery", "doi", "rcs", "shah", "rowland", "optimised", "radial", "basis", "function", "algorithm", "non", "rigid", "registration", "images", "computers", "biology", "prager", "fetal", "moulding", "finite", "element", "analysis", "fetal", "skull", "subjected", "uterine", "pressures", "during", "first", "stage", "labour", "journal", "biomechanics", "prager", "shape", "recovery", "newborn", "skull", "thin", "plate", "splines", "computerized", "imaging", "teaches", "st", "year", "ug", "nd", "year", "ug", "games", "advanced", "programming", "at", "member", "epsrc", "college", "fellow", "london", "ltn", "reviewer", "several", "renowned", "journals", "conferences", "bsc", "imaging", "multimedia", "msc", "games", "coordinator", "this", "page", "out", "date", "incorrect", "out", "you", "can", "page", "this", "page", "was", "generated", "at", "december", "click", "get", "fresh", "copy", "available", "be", "following", "hubs", "forms", "service", "living", "off", "available", "discussions", "board", "documents", "ethics", "specific", "guidelines", "handbook", "kb", "exam", "papers", "theses", "probationary", "period", "read", "past", "proud", "announce", "progressive", "inclusive", "culture", "standard", "subjects", "able", "examine", "way", "widely", "men", "family", "caring", "dual", "relationships", "achieve", "potential", "flourish", "address", "gender", "inequalities", "requires", "commitment", "action", "levels", "organisation", "tackle", "unequal", "representation", "requires", "changing", "cultures", "attitudes", "across", "organisation", "absence", "management", "making", "levels", "broad", "implications", "organisation", "will", "examine", "high", "loss", "rate", "urgent", "concern", "organisation", "will", "address", "short", "term", "contracts", "particularly", "negative", "consequences", "retention", "progression", "organisation", "there", "both", "personal", "structural", "obstacles", "making", "transition", "into", "sustainable", "require", "active", "consideration", "organization", "regular", "self", "assessment", "take", "place", "involving", "representatives", "levels", "roles", "look", "many", "aspects", "place", "range", "identify", "improvement", "feeds", "into", "plays", "strong", "influencing", "changes", "central", "policies", "strategy", "via", "central", "steering", "committee", "it", "active", "agenda", "keen", "play", "helping", "create", "positive", "equal", "positions", "holder", "currently", "towards", "particularly", "applications", "female", "candidates", "nominations", "developher", "bcs", "it", "useful", "societies", "networks", "sprint", "developments", "bcs", "grants", "developher", "alg", "summary", "cignets", "workshop", "program", "hopper", "colloquium", "inclusion", "ict", "past", "bbc", "documentary", "ada", "lovelace", "posters", "zip", "margaret", "hamilton", "suffrage", "scheme", "maths", "mb", "gavin", "cawley", "miss", "lisanne", "gitsels", "padma", "mr", "matthew", "gooch", "officer", "elena", "kulinskaya", "statistics", "katie", "co", "ordinator", "taoyang", "experience", "docs", "per", "cent", "secure", "continue", "some", "gone", "become", "sales", "executives", "earning", "competitive", "salaries", "whilst", "others", "secured", "established", "such", "ibm", "aviva", "logica", "analysts", "web", "designers", "managers", "others", "followed", "entrepreneurial", "path", "established", "own", "while", "some", "chose", "continue", "enter", "professionally", "market", "very", "competitive", "endeavour", "ensure", "receive", "prepare", "them", "further", "reflect", "skills", "aspirations", "relate", "give", "run", "invaluable", "workshops", "finding", "techniques", "write", "cv", "effectively", "please", "according", "interest", "internships", "enter", "login", "external", "please", "go", "postdoc", "others", "please", "go", "further", "queries", "related", "please", "colonoscopy", "obstetrics", "surgeon", "vasu", "inguinal", "hernia", "repair", "trainee", "surgeons", "throughout", "interventions", "aside", "underlying", "mass", "spring", "here", "focus", "finer", "implementing", "simulator", "collision", "detection", "earlier", "inguinal", "hernia", "repair", "ihr", "force", "interface", "shown", "movie", "snapshots", "force", "scene", "bump", "mapping", "left", "right", "respectively", "bump", "mapping", "bump", "mapping", "crowd", "cultural", "augmenting", "graphical", "user", "interfaces", "assistance", "impaired", "operators", "automatic", "construction", "radiotherapy", "treatment", "shells", "humans", "expressive", "proteins", "field", "point", "view", "largely", "classified", "two", "mining", "mining", "national", "twin", "set", "chronic", "disease", "cardiovascular", "disease", "risk", "primary", "care", "point", "view", "expertise", "applied", "numerous", "conditions", "specialties", "including", "cardio", "vascular", "disease", "dentistry", "diabetes", "neck", "mental", "nutrition", "oncology", "orthopaedics", "radiology", "radiotherapy", "demo", "video", "interaction", "brain", "courtesy", "mrs"]